zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_ll_usb_drd.c
/**
  ******************************************************************************
  * @file    stm32mp2xx_ll_usb_drd.c
  * @author  MCD Application Team
  * @brief   USB Low Layer HAL module driver.
  *
  *          This file provides firmware functions to manage the following
  *          functionalities of the USB Peripheral Controller:
  *           + Initialization/de-initialization functions
  *           + I/O operation functions
  *           + Peripheral Control functions
  *           + Peripheral State functions
  *
  @verbatim
  ==============================================================================
                    ##### How to use this driver #####
  ==============================================================================
    [..]
      (#) Fill parameters of Init structure in USB_DWC3_CfgTypeDef structure.

      (#) Call USB_CoreInit() API to initialize the USB Core peripheral.

      (#) The upper HAL HCD/PCD driver will call the right routines for its internal processes.

  @endverbatim
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include <string.h>
#include <stdio.h>
#include "stm32mp2xx_hal.h"

/** @addtogroup STM32MP2xx_LL_USB_DRIVER
  * @{
  */

#define LL_DBGLOG(...)  (void)printf("LL_DEBUG : " __VA_ARGS__);
#define LL_DBGLOG_ONCE(...) ({ \
                               static bool __warned; \
                               \
                               if (__warned == false) \
                               { \
                                 __warned = true; \
                                 (void)printf("LL_DEBUG(Once) : " __VA_ARGS__); \
                               } \
                             })
#if (LL_DEBUG_LEVEL > 0)
#define LL_DBGLOG1(...) (void)printf("LL_DEBUG : " __VA_ARGS__);
#else
#define LL_DBGLOG1(...)
#endif /*LL_DBGLOG1*/
#if (LL_DEBUG_LEVEL > 1)
#define LL_DBGLOG2(...) (void)printf("LL_DEBUG : " __VA_ARGS__);
#else
#define LL_DBGLOG2(...)
#endif /*LL_DBGLOG2*/
#if (LL_DEBUG_LEVEL > 2)
#define LL_DBGLOG3(...) (void)printf("LL_DEBUG : " __VA_ARGS__);
#else
#define LL_DBGLOG3(...)
#endif /*LL_DBGLOG3*/

#if defined (HAL_PCD_MODULE_ENABLED) || defined (HAL_HCD_MODULE_ENABLED)

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/

/* Masking macros */
#define UPPER_32_BITS(n) ((uint32_t)(((n) >> 16) >> 16))
#define LOWER_32_BITS(n) ((uint32_t)(n))

/**
  * @brief DWC3 Specific macros
  */
#define DWC3_REG32(base, x) (*(__IO uint32_t *)(((uint32_t)(base)) + (x)))

/* DWC3 IP Parameter */
#define DWC3_IP_DEVICE_NUM_INT  2U
#define DWC3_IP_NUM_EPS     32U
#define DWC3_IP_NUM_IN_EPS    16U

/* Global Registers */
#define DWC3_GSBUSCFG0    (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GSBUSCFG0
#define DWC3_GSBUSCFG1    (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GSBUSCFG1
#define DWC3_GTXTHRCFG    (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GTXTHRCFG
#define DWC3_GRXTHRCFG    (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GRXTHRCFG
#define DWC3_GCTL     (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GCTL
#define DWC3_GPMSTS    (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GPMSTS
#define DWC3_GSTS     (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GSTS
#define DWC3_GUCTL1     (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GUCTL1
#define DWC3_GSNPSID    (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GSNPSID
#define DWC3_GGPIO      (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GGPIO
#define DWC3_GUID     (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GUID
#define DWC3_GUCTL      (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GUCTL
#define DWC3_GBUSERRADDR0 (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GBUSERRADDRLO
#define DWC3_GBUSERRADDR1 (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GBUSERRADDRHI
#define DWC3_GPRTBIMAP0   (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GPRTBIMAPLO
#define DWC3_GPRTBIMAP1   (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GPRTBIMAPHI
#define DWC3_GHWPARAMS0   (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GHWPARAMS0
#define DWC3_GHWPARAMS1   (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GHWPARAMS1
#define DWC3_GHWPARAMS2   (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GHWPARAMS2
#define DWC3_GHWPARAMS3   (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GHWPARAMS3
#define DWC3_GHWPARAMS4   (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GHWPARAMS4
#define DWC3_GHWPARAMS5   (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GHWPARAMS5
#define DWC3_GHWPARAMS6   (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GHWPARAMS6
#define DWC3_GHWPARAMS7   (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GHWPARAMS7
#define DWC3_GHWPARAMS8   (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GHWPARAMS8
#define DWC3_GDBGFIFOSPACE  (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GDBGFIFOSPACE
#define DWC3_GDBGLTSSM    (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GDBGLTSSM
#define DWC3_GDBGLNMCC    (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GDBGLNMCC
#define DWC3_GDBGBMU    (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GDBGBMU
#define DWC3_GDBGLSPMUX_HST    (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GDBGLSPMUX_HST
#define DWC3_GDBGLSP    (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GDBGLSP
#define DWC3_GDBGEPINFO0    (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GDBGEPINFO0
#define DWC3_GDBGEPINFO1    (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GDBGEPINFO1
#define DWC3_GPRTBIMAP_HS0  (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GPRTBIMAP_HSLO
#define DWC3_GPRTBIMAP_HS1  (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GPRTBIMAP_HSHI
#define DWC3_GPRTBIMAP_FS0  (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GPRTBIMAP_FSLO
#define DWC3_GPRTBIMAP_FS1  (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GPRTBIMAP_FSHI
#define DWC3_GUCTL2  (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GUCTL2

#define DWC3_GUSB2PHYCFG(n) (uint32_t)(&((USB3_TypeDef *)(NULL))->GBLREGS.GUSB2PHYCFG + n)

#define DWC3_GUSB2PHYACC(n) (uint32_t)(&((USB3_TypeDef *)(NULL))->GBLREGS.GUSB2PHYACC_UTMI + n)

