zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_ll_usb_drd.c
#define DWC3_GUSB3PIPECTL(n)  (uint32_t)(&((USB3_TypeDef *)(NULL))->GBLREGS.GUSB3PIPECTL + n)

#define DWC3_GTXFIFOSIZ(n)  (uint32_t)(&((USB3_TypeDef *)(NULL))->GBLREGS.GTXFIFOSIZ0 + n)
#define DWC3_GRXFIFOSIZ(n)  (uint32_t)(&((USB3_TypeDef *)(NULL))->GBLREGS.GRXFIFOSIZ0 + n)

#define DWC3_GEVNTADRLO(n)  (uint32_t)(&((USB3_TypeDef *)(NULL))->GBLREGS.GEVNTADRLO + (4UL*n))
#define DWC3_GEVNTADRHI(n)  (uint32_t)(&((USB3_TypeDef *)(NULL))->GBLREGS.GEVNTADRHI + (4UL*n))
#define DWC3_GEVNTSIZ(n)  (uint32_t)(&((USB3_TypeDef *)(NULL))->GBLREGS.GEVNTSIZ + (4UL*n))
#define DWC3_GEVNTCOUNT(n)  (uint32_t)(&((USB3_TypeDef *)(NULL))->GBLREGS.GEVNTCOUNT + (4UL*n))

#define DWC3_GUCTL3            (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GUCTL3
#define DWC3_GTXFIFOPRIDEV     (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GTXFIFOPRIDEV
#define DWC3_GTXFIFOPRIHST     (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GTXFIFOPRIHST
#define DWC3_GRXFIFOPRIHST     (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GRXFIFOPRIHST
#define DWC3_GDMAHLRATIO       (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GDMAHLRATIO
#define DWC3_GFLADJ            (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.GFLADJ
#define DWC3_USB3_GUSB2RHBCTL  (uint32_t)&((USB3_TypeDef *)(NULL))->GBLREGS.USB3_GUSB2RHBCTL

#define DWC3_GUSB2PHYACC_ADDR(n)  ((n) << USB3_GUSB2PHYACC_UTMI_REGADDR_Pos)
#define DWC3_GUSB2PHYACC_EXTEND_ADDR(n) ((n) << USB3_GUSB2PHYACC_UTMI_EXTREGADDR_Pos)
#define DWC3_GUSB2PHYACC_DATA(n)  ((n) & USB3_GUSB2PHYACC_UTMI_REGDATA_Msk)

/* Device Registers */
#define DWC3_DCFG   (uint32_t)&((USB3_TypeDef *)(NULL))->DEVREGS.DCFG
#define DWC3_DCTL   (uint32_t)&((USB3_TypeDef *)(NULL))->DEVREGS.DCTL
#define DWC3_DEVTEN   (uint32_t)&((USB3_TypeDef *)(NULL))->DEVREGS.DEVTEN
#define DWC3_DSTS   (uint32_t)&((USB3_TypeDef *)(NULL))->DEVREGS.DSTS
#define DWC3_DGCMDPAR (uint32_t)&((USB3_TypeDef *)(NULL))->DEVREGS.DGCMDPAR
#define DWC3_DGCMD    (uint32_t)&((USB3_TypeDef *)(NULL))->DEVREGS.DGCMD
#define DWC3_DALEPENA (uint32_t)&((USB3_TypeDef *)(NULL))->DEVREGS.DALEPENA
#define DWC3_DEPCMDPAR2(n)  (uint32_t)(&((USB3_TypeDef *)(NULL))->DEVREGS.DEPCMDPAR20 + (4UL*n))
#define DWC3_DEPCMDPAR1(n)  (uint32_t)(&((USB3_TypeDef *)(NULL))->DEVREGS.DEPCMDPAR10 + (4UL*n))
#define DWC3_DEPCMDPAR0(n)  (uint32_t)(&((USB3_TypeDef *)(NULL))->DEVREGS.DEPCMDPAR00 + (4UL*n))
#define DWC3_DEPCMD(n)    (uint32_t)(&((USB3_TypeDef *)(NULL))->DEVREGS.DEPCMD0 + (4UL*n))
#define DWC3_DEV_IMOD (uint32_t)&((USB3_TypeDef *)(NULL))->DEVREGS.DEV_IMOD

/* Battery Charger Registers */
#define DWC3_BCFG   (uint32_t)&((USB3_TypeDef *)(NULL))->BCREGS.BCFG
#define DWC3_BCEVT   (uint32_t)&((USB3_TypeDef *)(NULL))->BCREGS.BCEVT
#define DWC3_BCEVTEN   (uint32_t)&((USB3_TypeDef *)(NULL))->BCREGS.BCEVTEN

/* Link Registers */
#define DWC3_LU1LFPSRXTIM  (uint32_t)&((USB3_TypeDef *)(NULL))->LINKREGS.LU1LFPSRXTIM
#define DWC3_SETTINGS      (uint32_t)&((USB3_TypeDef *)(NULL))->LINKREGS.SETTINGS
#define DWC3_LLUCTL        (uint32_t)&((USB3_TypeDef *)(NULL))->LINKREGS.LLUCTL
#define DWC3_LPTMDPDELAY   (uint32_t)&((USB3_TypeDef *)(NULL))->LINKREGS.LPTMDPDELAY

/* The EP number goes 0..31 so ep0 is always out and ep1 is always in */
#define DWC3_DALEPENA_EP(n)   (1UL << (n))

#define DWC3_DEPCMD_TYPE_CONTROL  0UL
#define DWC3_DEPCMD_TYPE_ISOC   1UL
#define DWC3_DEPCMD_TYPE_BULK   2UL
#define DWC3_DEPCMD_TYPE_INTR   3UL

#define DWC3_GCTL_PRTCAP(n) (((n) & USB3_GCTL_PRTCAPDIR_Msk) >> USB3_GCTL_PRTCAPDIR_Pos)
#define DWC3_GCTL_PRTCAPDIR(n)  ((n) << USB3_GCTL_PRTCAPDIR_Pos)
#define DWC3_GCTL_PRTCAP_HOST 1UL
#define DWC3_GCTL_PRTCAP_DEVICE 2UL
#define DWC3_GCTL_PRTCAP_OTG  3UL

#define DWC3_DSTS_SUPERSPEED  (4UL << USB3_DSTS_CONNECTSPD_Pos)
#define DWC3_DSTS_HIGHSPEED   (0UL << USB3_DSTS_CONNECTSPD_Pos)
#define DWC3_DSTS_FULLSPEED2  (1UL << USB3_DSTS_CONNECTSPD_Pos)
#define DWC3_DSTS_LOWSPEED    (2UL << USB3_DSTS_CONNECTSPD_Pos)
#define DWC3_DSTS_FULLSPEED1  (3UL << USB3_DSTS_CONNECTSPD_Pos)

#define DWC3_GEVNTCOUNT_MASK  0xfffcU
#define DWC3_GSNPSID_MASK 0xffff0000
#define DWC3_GSNPSREV_MASK  0xffff

#define DWC3_DCFG_DEVADDR(addr) ((addr) << 3)

#define DWC3_EVENT_TYPE_DEV 0U
#define DWC3_EVENT_TYPE_CARKIT  3U
#define DWC3_EVENT_TYPE_I2C 4U

#define DWC3_DEVICE_EVENT_DISCONNECT      0U
#define DWC3_DEVICE_EVENT_RESET         1U
#define DWC3_DEVICE_EVENT_CONNECT_DONE      2U
#define DWC3_DEVICE_EVENT_LINK_STATUS_CHANGE  3U
#define DWC3_DEVICE_EVENT_WAKEUP        4U
#define DWC3_DEVICE_EVENT_HIBER_REQ       5U
#define DWC3_DEVICE_EVENT_EOPF          6U
#define DWC3_DEVICE_EVENT_SOF         7U
#define DWC3_DEVICE_EVENT_ERRATIC_ERROR     9U
#define DWC3_DEVICE_EVENT_CMD_CMPL        10U
#define DWC3_DEVICE_EVENT_OVERFLOW        11U

/* DEPCFG parameter 1 */
#define DWC3_DEPCFG_INT_NUM(n)    (((n) & 0x1f) << 0)
#define DWC3_DEPCFG_XFER_COMPLETE_EN  (1UL << 8)
#define DWC3_DEPCFG_XFER_IN_PROGRESS_EN (1UL << 9)
#define DWC3_DEPCFG_XFER_NOT_READY_EN (1UL << 10)
#define DWC3_DEPCFG_FIFO_ERROR_EN (1UL << 11)
#define DWC3_DEPCFG_STREAM_EVENT_EN (1UL << 13)
#define DWC3_DEPCFG_BINTERVAL_M1(n) (((n) & 0xffU) << 16)
#define DWC3_DEPCFG_STREAM_CAPABLE  (1UL << 24)
#define DWC3_DEPCFG_EP_NUMBER(n)  (((n) & 0x1fUL) << 25)
#define DWC3_DEPCFG_BULK_BASED    (1UL << 30)
#define DWC3_DEPCFG_FIFO_BASED    (1UL << 31)

/* DEPCFG parameter 0 */
#define DWC3_DEPCFG_EP_TYPE(n)    (((n) & 0x3UL) << 1)
#define DWC3_DEPCFG_MAX_PACKET_SIZE(n)  (((n) & 0x7ffU) << 3)
#define DWC3_DEPCFG_FIFO_NUMBER(n)  (((n) & 0x1fUL) << 17)
#define DWC3_DEPCFG_BURST_SIZE(n) (((n) & 0xf) << 22)
#define DWC3_DEPCFG_DATA_SEQ_NUM(n) ((n) << 26)
/* DEPCFG parameter 1 */
#define DWC3_DEPCFG_EP_INTR_NUM(n)  ((n) & 0x1fUL)
/* This applies for core versions earlier than 1.94a */
#define DWC3_DEPCFG_IGN_SEQ_NUM   (1UL << 31)
/* These apply for core versions 1.94a and later */
#define DWC3_DEPCFG_ACTION_INIT   (0UL << 30)
#define DWC3_DEPCFG_ACTION_RESTORE  (1UL << 30)
#define DWC3_DEPCFG_ACTION_MODIFY (2UL << 30)
#define DWC3_DEPCFG_ACTION_VALUE(n)   (((n) & 0x3UL) << 30)

/* DEPXFERCFG parameter 0 */
#define DWC3_DEPXFERCFG_NUM_XFER_RES(n) ((n) & 0xffffU)

#define DWC3_DEPCMD_GET_RSC_IDX(x)  (((x) >> USB3_DEPCMD_COMMANDPARAM_Pos) & 0x7fU)
#define DWC3_DEPCMD_STATUS(x)   (((x) & USB3_DEPCMD_CMDSTATUS_Msk) >> 12)
#define DWC3_DGCMD_STATUS(n)  (((n) & USB3_DGCMD_CMDSTATUS_Msk) >> USB3_DGCMD_CMDSTATUS_Pos)
#define DWC3_DEPCMD_PARAM(x)    ((x) << USB3_DEPCMD_COMMANDPARAM_Pos)

/* LINK STATE Types */
#define DWC3_LINK_STATE_SS_U0   0x00U /* in HS, means ON */
#define DWC3_LINK_STATE_SS_U1   0x01U
#define DWC3_LINK_STATE_SS_U2   0x02U /* in HS, means SLEEP */
#define DWC3_LINK_STATE_SS_U3   0x03U /* in HS, means SUSPEND */
#define DWC3_LINK_STATE_SS_DIS    0x04U /* Default State */
#define DWC3_LINK_STATE_SS_RX_DET 0x05U /* in HS, means Early Suspend */
#define DWC3_LINK_STATE_SS_INACT  0x06U
#define DWC3_LINK_STATE_SS_POLL   0x07U
#define DWC3_LINK_STATE_SS_RECOV  0x08U
#define DWC3_LINK_STATE_SS_HRESET 0x09U
#define DWC3_LINK_STATE_SS_CMPLY  0x0aU
#define DWC3_LINK_STATE_SS_LPBK   0x0bU
#define DWC3_LINK_STATE_SS_RESET  0x0eU
#define DWC3_LINK_STATE_SS_RESUME 0x0fU

#define DWC3_LINK_STATE_ON    0x00U /* in HS, means ON */
#define DWC3_LINK_STATE_L1    0x02U /* in HS, means SLEEP */
#define DWC3_LINK_STATE_L2    0x03U /* in HS, means SUSPEND */
#define DWC3_LINK_STATE_DIS   0x04U /* Default State */
#define DWC3_LINK_STATE_EARLY_SUS 0x05U /* in HS, means Early Suspend */
#define DWC3_LINK_STATE_RESET 0x0eU
#define DWC3_LINK_STATE_RESUME  0x0fU

