zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_ll_usb_drd.c
#define DWC3_DCTL_ULSTCHNG_NO_ACTION  0U
#define DWC3_DCTL_ULSTCHNG_SS_DISABLED  4U
#define DWC3_DCTL_ULSTCHNG_RX_DETECT  5U
#define DWC3_DCTL_ULSTCHNG_SS_INACTIVE  6U
#define DWC3_DCTL_ULSTCHNG_RECOVERY   8U
#define DWC3_DCTL_ULSTCHNG_COMPLIANCE 10U
#define DWC3_DCTL_ULSTCHNG_LOOPBACK   11U

#define DWC3_DCTL_ULSTCHNGREQ(n)  (((n) << USB3_DCTL_ULSTCHNGREQ_Pos) & USB3_DCTL_ULSTCHNGREQ_Msk)

#define DWC3_DSTS_USBLNKST(n)   (((n) & USB3_DSTS_USBLNKST_Msk) >> USB3_DSTS_USBLNKST_Pos)

/* TRB Length, PCM and Status */
#define DWC3_TRB_SIZE_MASK  (0x00ffffffUL)
#define DWC3_TRB_SIZE_LENGTH(n) ((n) & DWC3_TRB_SIZE_MASK)
#define DWC3_TRB_SIZE_PCM1(n) (((n) & 0x03UL) << 24)
#define DWC3_TRB_SIZE_TRBSTS(n) (((n) & (0x0fUL << 28)) >> 28)

#define DWC3_TRBSTS_OK      0U
#define DWC3_TRBSTS_MISSED_ISOC   1U
#define DWC3_TRBSTS_SETUP_PENDING 2U
#define DWC3_TRBSTS_XFER_IN_PROG 4U

/* TRB Control */
#define DWC3_TRB_CTRL_HWO   (1UL << 0)
#define DWC3_TRB_CTRL_LST   (1UL << 1)
#define DWC3_TRB_CTRL_CHN   (1UL << 2)
#define DWC3_TRB_CTRL_CSP   (1UL << 3)
#define DWC3_TRB_CTRL_TRBCTL(n)   (((n) & 0x3fU) << 4)
#define DWC3_TRB_CTRL_ISP_IMI   (1UL << 10)
#define DWC3_TRB_CTRL_IOC   (1UL << 11)
#define DWC3_TRB_CTRL_SID_SOFN(n) (((n) & 0xffffUL) << 14)

#define DWC3_TRBCTL_NORMAL    DWC3_TRB_CTRL_TRBCTL(1U)
#define DWC3_TRBCTL_CONTROL_SETUP DWC3_TRB_CTRL_TRBCTL(2U)
#define DWC3_TRBCTL_CONTROL_STATUS2 DWC3_TRB_CTRL_TRBCTL(3U)
#define DWC3_TRBCTL_CONTROL_STATUS3 DWC3_TRB_CTRL_TRBCTL(4U)
#define DWC3_TRBCTL_CONTROL_DATA  DWC3_TRB_CTRL_TRBCTL(5U)
#define DWC3_TRBCTL_ISOCHRONOUS_FIRST DWC3_TRB_CTRL_TRBCTL(6U)
#define DWC3_TRBCTL_ISOCHRONOUS   DWC3_TRB_CTRL_TRBCTL(7U)
#define DWC3_TRBCTL_LINK_TRB    DWC3_TRB_CTRL_TRBCTL(8U)

#define MASK(len, pos)    (((1UL << (len)) - 1UL) << (pos))

/* Event Types */
#define DWC3_EVT_TYPE_EP 0x0UL
#define DWC3_EVT_TYPE_LEN 0x1UL
#define DWC3_EVT_TYPE_BITPOS 0x0UL
#define DWC3_EVT_TYPE_MASK MASK(DWC3_EVT_TYPE_LEN, DWC3_EVT_TYPE_BITPOS)
#define DWC3_EVT_TYPE_DEVSPEC 0x1UL
#define DWC3_EVT_TYPE_NEP_TYPE_BITPOS 1UL
#define DWC3_EVT_TYPE_NEP_TYPE_LEN 7UL
#define DWC3_EVT_TYPE_NEP_TYPE_MASK MASK(DWC3_EVT_TYPE_NEP_TYPE_LEN, DWC3_EVT_TYPE_NEP_TYPE_BITPOS)

#define DWC3_DEPEVT_XFERCOMPLETE  0x01UL
#define DWC3_DEPEVT_XFERINPROGRESS  0x02UL
#define DWC3_DEPEVT_XFERNOTREADY  0x03UL
#define DWC3_DEPEVT_RXTXFIFOEVT   0x04UL
#define DWC3_DEPEVT_STREAMEVT   0x06UL
#define DWC3_DEPEVT_EPCMDCMPLT    0x07UL

#define DWC3_EVT_DEPEVT_TYPE_BITPOS 6UL
#define DWC3_EVT_DEPEVT_TYPE_LEN  4UL
#define DWC3_EVT_DEPEVT_TYPE_MASK MASK(DWC3_EVT_DEPEVT_TYPE_LEN, DWC3_EVT_DEPEVT_TYPE_BITPOS)

#define DWC3_EVT_DEPEVT_EPNUM_BITPOS  1UL
#define DWC3_EVT_DEPEVT_EPNUM_LEN   5UL
#define DWC3_EVT_DEPEVT_EPNUM_MASK MASK(DWC3_EVT_DEPEVT_EPNUM_LEN, DWC3_EVT_DEPEVT_EPNUM_BITPOS)

#define DWC3_EVT_DEPEVT_STATUS_BITPOS 12UL
#define DWC3_EVT_DEPEVT_STATUS_LEN    4UL
#define DWC3_EVT_DEPEVT_STATUS_MASK MASK(DWC3_EVT_DEPEVT_STATUS_LEN, DWC3_EVT_DEPEVT_STATUS_BITPOS)

/* Control-only Status */
#define DWC3_EVT_DEPEVT_STATUS_CONTROL_DATA   1UL
#define DWC3_EVT_DEPEVT_STATUS_CONTROL_STATUS 2UL

#define DWC3_EVT_DEPEVT_PARAM_BITPOS  16UL
#define DWC3_EVT_DEPEVT_PARAM_LEN   16UL
#define DWC3_EVT_DEPEVT_PARAM_MASK MASK(DWC3_EVT_DEPEVT_PARAM_LEN, DWC3_EVT_DEPEVT_PARAM_BITPOS)

#define DWC3_EVT_DEVEVT_TYPE_BITPOS   8UL
#define DWC3_EVT_DEVEVT_TYPE_LEN    4UL
#define DWC3_EVT_DEVEVT_TYPE_MASK MASK(DWC3_EVT_DEVEVT_TYPE_LEN, DWC3_EVT_DEVEVT_TYPE_BITPOS)

#define DWC3_EVT_DEVEVT_LNKSTS_BITPOS 16UL
#define DWC3_EVT_DEVEVT_LNKSTS_LEN    4UL
#define DWC3_EVT_DEVEVT_LNKSTS_MASK MASK(DWC3_EVT_DEVEVT_LNKSTS_LEN, DWC3_EVT_DEVEVT_LNKSTS_BITPOS)

/*
 * ULPI Register Map
 */
#define ULPI_VENDOR_ID_LOW      0x00U
#define ULPI_VENDOR_ID_HIGH     0x01U
#define ULPI_PRODUCT_ID_LOW     0x02U
#define ULPI_PRODUCT_ID_HIGH      0x03U
#define ULPI_FUNC_CTRL        0x04U
#define ULPI_IFC_CTRL       0x07U
#define ULPI_OTG_CTRL       0x0aU
#define ULPI_USB_INT_EN_RISE      0x0dU
#define ULPI_USB_INT_EN_FALL      0x10U
#define ULPI_USB_INT_STS      0x13U
#define ULPI_USB_INT_LATCH      0x14U
#define ULPI_DEBUG        0x15U
#define ULPI_SCRATCH        0x16U
/* Optional Carkit Registers */
#define ULPI_CARKIT_CTRL      0x19U
#define ULPI_CARKIT_INT_DELAY     0x1cU
#define ULPI_CARKIT_INT_EN      0x1dU
#define ULPI_CARKIT_INT_STS     0x20U
#define ULPI_CARKIT_INT_LATCH     0x21U
#define ULPI_CARKIT_PLS_CTRL      0x22U
/* Other Optional Registers */
#define ULPI_TX_POS_WIDTH     0x25U
#define ULPI_TX_NEG_WIDTH     0x26U
#define ULPI_POLARITY_RECOVERY      0x27U
/* Access Extended Register Set */
#define ULPI_ACCESS_EXTENDED      0x2fU
/* Vendor Specific */
#define ULPI_VENDOR_SPECIFIC      0x30U
/* Extended Registers */
#define ULPI_EXT_VENDOR_SPECIFIC    0x80U

/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

static void USB_PHYInit(void)
{
  return;
}

static void USB_PHYUnInit(void)
{
  return;
}

static void USB_Delay(uint32_t time_in_us)
{
  __IO uint32_t delay = time_in_us * (SystemCoreClock / 1000000U);

  /* Check if System Clock is at least Mhz */
  if (delay == 0U)
  {
    LL_DBGLOG_ONCE("System Clock %ld is slower than delay period requested %ld uS, delay only 1 SysClock Cycle\n",
                   SystemCoreClock, time_in_us);
  }
  else
  {
    delay += ((SystemCoreClock % 1000000U) == 0U) ? 0U : 1U;
  }

  do
  {
    __NOP();
    delay --;
  } while (delay > 0U);

  return;
}

/* Exported functions --------------------------------------------------------*/
/** @defgroup LL_USB_Exported_Functions USB Low Layer Exported Functions
  * @{
  */

/** @defgroup LL_USB_Group1 Initialization/de-initialization functions
  *  @brief    Initialization and Configuration functions
  *
@verbatim
 ===============================================================================
              ##### Initialization/de-initialization functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:

@endverbatim
  * @{
  */

/**
  * @brief  DWC3_RegRead : USB3 Register Read
  * @param  base    Base Register address
  * @param  offset  Register offset
  * @retval Register Value
  */
static uint32_t DWC3_RegRead(const USB3_TypeDef *base, uint32_t offset)
{
#ifndef DMA_MEM_NON_BUFFERABLE
  __DSB();
#endif /*DMA_MEM_NON_BUFFERABLE*/
  return DWC3_REG32(base, offset);
}

/**
  * @brief  DWC3_RegWrite : USB3 Register Write
  * @param  base    Base Register address
  * @param  offset  Register offset
  * @param  value   Value to be written to the register
  */
static void DWC3_RegWrite(USB3_TypeDef *base, uint32_t offset, uint32_t value)
{
#ifndef DMA_MEM_NON_BUFFERABLE
  __DSB();
#endif /*DMA_MEM_NON_BUFFERABLE*/
  DWC3_REG32(base, offset) = value;
}

/**
  * @brief  DWC3_RegUpdateSet : USB3 Register update set mask
  * @param  base    Base Register address
  * @param  offset  Register offset
  * @param  set_mask   Register set_mask
  */
static void DWC3_RegUpdateSet(USB3_TypeDef *base, uint32_t offset, uint32_t set_mask)
{
  DWC3_RegWrite(base, offset, DWC3_RegRead(base, offset) | set_mask);
}

/**
  * @brief  DWC3_RegUpdateClr : USB3 Register update clr mask
  * @param  base    Base Register address
  * @param  offset  Register offset
  * @param  clr_mask   Register clr_mask
  */
static void DWC3_RegUpdateClr(USB3_TypeDef *base, uint32_t offset, uint32_t clr_mask)
{
  DWC3_RegWrite(base, offset, DWC3_RegRead(base, offset) & ~clr_mask);
}


/**
  * @brief  DWC3_SoftReset : USB3 Device Soft Reset
  * @param  USBx  Selected device
  * @retval HAL status
  */
static HAL_StatusTypeDef DWC3_SoftReset(USB3_TypeDef *USBx)
{
  uint32_t tickstart;
  uint32_t timeout = 500; /* msec */

  /* Get tick */
  tickstart = HAL_GetTick();

  DWC3_RegWrite(USBx, DWC3_DCTL, USB3_DCTL_CSFTRST);
  do
  {
    if ((DWC3_RegRead(USBx, DWC3_DCTL) & USB3_DCTL_CSFTRST) == 0U)
    {
      break;
    }

    if ((HAL_GetTick()  - tickstart) > timeout)
      /* "Reset Timed Out" */
    {
      return HAL_TIMEOUT;
    }

  } while (true);

  return HAL_OK;
}

static uint32_t DWC3_GetTRBCtlType(uint32_t trb_type)
{
  uint32_t ret;

