zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_ll_usb_drd.c
  switch (trb_type)
  {
    case USB_DWC3_TRBCTL_NORMAL:
      ret = DWC3_TRBCTL_NORMAL;
      break;
    case USB_DWC3_TRBCTL_CONTROL_SETUP:
      ret = DWC3_TRBCTL_CONTROL_SETUP;
      break;
    case USB_DWC3_TRBCTL_CONTROL_STATUS2:
      ret = DWC3_TRBCTL_CONTROL_STATUS2;
      break;
    case USB_DWC3_TRBCTL_CONTROL_STATUS3:
      ret = DWC3_TRBCTL_CONTROL_STATUS3;
      break;
    case USB_DWC3_TRBCTL_CONTROL_DATA:
      ret = DWC3_TRBCTL_CONTROL_DATA;
      break;
    case USB_DWC3_TRBCTL_ISOCHRONOUS_FIRST:
      ret = DWC3_TRBCTL_ISOCHRONOUS_FIRST;
      break;
    case USB_DWC3_TRBCTL_ISOCHRONOUS:
      ret = DWC3_TRBCTL_ISOCHRONOUS;
      break;
    case USB_DWC3_TRBCTL_LINK_TRB:
      ret = DWC3_TRBCTL_LINK_TRB;
      break;
    default:
      ret = 0U;
      break;
  }

  return ret;
}

static uint32_t DWC3_GetEPCFGAction(uint8_t action)
{
  uint32_t ret;

  switch (action)
  {
    case USB_DWC3_DEPCFG_ACTION_INIT:
      ret = DWC3_DEPCFG_ACTION_INIT;
      break;
    case USB_DWC3_DEPCFG_ACTION_RESTORE:
      ret = DWC3_DEPCFG_ACTION_RESTORE;
      break;
    case USB_DWC3_DEPCFG_ACTION_MODIFY:
      ret = DWC3_DEPCFG_ACTION_MODIFY;
      break;
    default:
      ret = 0U;
      break;
  }

  return ret;
}


/**
  * @brief  Initializes the USB Core
  * @param  USBx USB Instance
  * @param  cfg  pointer to a USB_DWC3_CfgTypeDef structure that contains
  *         the configuration information for the specified USBx peripheral.
  * @retval HAL status
  */
HAL_StatusTypeDef USB_CoreInit(USB3_TypeDef *USBx, USB_DWC3_CfgTypeDef cfg)
{
  HAL_StatusTypeDef ret;
  LL_DBGLOG("Core ID %08lx\n", (uint32_t)DWC3_RegRead(USBx, DWC3_GSNPSID));

  /* Set GUSB3PIPECTL for all USB3 ports (1-n), currently doing only for 0 */
  if ((cfg.phy_itface & USB3PHY_MASK) != 0U)
  {
    /* Relying on default value */
  }

  /* Set GUSB2PHYCFG for all USB2 ports (1-m), currently doing only for 0 */
  if ((cfg.phy_itface & USB2PHY_MASK) != 0U)
  {
    switch (cfg.phy_itface)
    {
      case USBPHY_UTMI:
        DWC3_RegUpdateClr(USBx, DWC3_GUSB2PHYCFG(0UL), USB3_GUSB2PHYCFG_ULPI_UTMI_Sel);
        break;
      case USBPHY_ULPI:
        DWC3_RegUpdateSet(USBx, DWC3_GUSB2PHYCFG(0UL), USB3_GUSB2PHYCFG_ULPI_UTMI_Sel);
        break;
      default:
        /* Relying on default value. */
        break;
    }
  }

  /* issue device SoftReset */
  ret = DWC3_SoftReset(USBx);
  if (ret != HAL_OK)
  {
    LL_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
    return ret;
  }

  /* Put PHYs in reset */
  /* Before Resetting PHY, put Core in Reset */
  DWC3_RegUpdateSet(USBx, DWC3_GCTL, USB3_GCTL_CORESOFTRESET);

  /* Assert USB3 PHY reset for all USB3 ports (1-n), currently doing only for 0 */
  if ((cfg.phy_itface & USB3PHY_MASK) != 0U)
  {
    DWC3_RegUpdateSet(USBx, DWC3_GUSB3PIPECTL(0UL), USB3_GUSB3PIPECTL_PHYSoftRst);
  }

  /* Assert USB2 PHY reset for all USB2 ports (1-m), currently doing only for 0 */
  if ((cfg.phy_itface & USB2PHY_MASK) != 0U)
  {
    DWC3_RegUpdateSet(USBx, DWC3_GUSB2PHYCFG(0UL), USB3_GUSB2PHYCFG_PHYSOFTRST);
  }

  /* Program PHY signals - PHY specific */
  USB_PHYInit();

  /* Release PHY out of reset */
#ifndef USE_STM32MP257CXX_EMU
  /* delay un-necessary in EMU since no phy */
  HAL_Delay(100); /* 100ms*/
#endif /*USE_STM32MP257CXX_EMU*/

  /* Clear USB3 PHY reset for all USB3 ports (1-n), currently doing only for 0 */
  if ((cfg.phy_itface & USB3PHY_MASK) != 0U)
  {
    DWC3_RegUpdateClr(USBx, DWC3_GUSB3PIPECTL(0UL), USB3_GUSB3PIPECTL_PHYSoftRst);
  }

  /* Clear USB2 PHY reset */
  if ((cfg.phy_itface & USB2PHY_MASK) != 0U)
  {
    DWC3_RegUpdateClr(USBx, DWC3_GUSB2PHYCFG(0UL), USB3_GUSB2PHYCFG_PHYSOFTRST);
  }

#ifndef USE_STM32MP257CXX_EMU
  /* delay un-necessary in EMU since no phy */
  HAL_Delay(100); /* 100ms*/
#endif /*USE_STM32MP257CXX_EMU*/

  /* After PHYs are stable we can take Core out of reset state */
  DWC3_RegUpdateClr(USBx, DWC3_GCTL, USB3_GCTL_CORESOFTRESET);

  /* From Linux Driver */
  DWC3_RegWrite(USBx, DWC3_GSBUSCFG0, 0xe);
  DWC3_RegWrite(USBx, DWC3_GSBUSCFG1, 0xf00);

  return HAL_OK;
}

/**
  * @brief  UnInitializes the USB Core
  * @param  USBx USB Instance
  * @retval HAL status
  */
HAL_StatusTypeDef USB_CoreUnInit(const USB3_TypeDef *USBx)
{
  UNUSED(USBx);
  /* Program PHY signals - PHY specific */
  USB_PHYUnInit();
  return HAL_OK;
}

/**
  * @brief  USB_SetCurrentMode : Set functional mode
  * @param  USBx  Selected device
  * @param  mode   current core mode
  *          This parameter can be one of these values:
  *            @arg USB_DWC3_DEVICE_MODE: Peripheral mode
  *            @arg USB_DWC3_HOST_MODE: Host mode
  *            @arg USB_DWC3_DRD_MODE: Dual Role Device mode
  * @retval HAL status
  */
HAL_StatusTypeDef USB_SetCurrentMode(USB3_TypeDef *USBx, USB_DWC3_ModeTypeDef mode)
{
  uint32_t reg;
  HAL_StatusTypeDef ret = HAL_OK;
  reg = DWC3_RegRead(USBx, DWC3_GCTL) & ~USB3_GCTL_PRTCAPDIR_Msk;

  switch (mode)
  {
    case USB_DWC3_DEVICE_MODE:
      DWC3_RegWrite(USBx, DWC3_GCTL, reg | DWC3_GCTL_PRTCAPDIR(DWC3_GCTL_PRTCAP_DEVICE));
      break;
    case USB_DWC3_HOST_MODE:
      DWC3_RegWrite(USBx, DWC3_GCTL, reg | DWC3_GCTL_PRTCAPDIR(DWC3_GCTL_PRTCAP_HOST));
      break;
    case USB_DWC3_DRD_MODE:
      DWC3_RegWrite(USBx, DWC3_GCTL, reg | DWC3_GCTL_PRTCAPDIR(DWC3_GCTL_PRTCAP_OTG));
      break;
    default:
      ret = HAL_ERROR;
      break;
  }

  return ret;
}

/**
  * @brief  USB_DevInit : Initializes the USB3 controller registers
  *         for device mode
  * @param  USBx  Selected device
  * @param  cfg   pointer to a USB_DWC3_CfgTypeDef structure that contains
  *         the configuration information for the specified USBx peripheral.
  * @retval HAL status
  */
HAL_StatusTypeDef USB_DevInit(USB3_TypeDef *USBx, USB_DWC3_CfgTypeDef cfg,
                              USB_DWC3_DmaBusAddr evt_buf_dma_addr[], USB_DWC3_EPTypeDef *ep0,
                              USB_DWC3_DmaBusAddr setup_buf_dma_addr, USB_DWC3_INTNum intr_dev)
{
  uint32_t reg;
  uint8_t i;
  USB_DWC3_EPCmdParams params;
  HAL_StatusTypeDef ret;

  /* Setup event buffers k = USB_DWC3_INT_INUSE */
  for (i = 0; i < USB_DWC3_INT_INUSE; i++)
  {
    DWC3_RegWrite(USBx, DWC3_GEVNTADRLO(i), LOWER_32_BITS(evt_buf_dma_addr[i]));
    DWC3_RegWrite(USBx, DWC3_GEVNTADRHI(i), UPPER_32_BITS(evt_buf_dma_addr[i]));
    DWC3_RegWrite(USBx, DWC3_GEVNTSIZ(i), USB_DWC3_EVENT_BUFFER_SIZE);
    DWC3_RegWrite(USBx, DWC3_GEVNTCOUNT(i), 0);
    /* EvtBufferPos[i] = 0;  Implicit since static done in HAL */
  }

  ret = USB_SetCurrentMode(USBx, USB_DWC3_DEVICE_MODE);
  if (ret != HAL_OK)
  {
    LL_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
    return ret;
  }

