zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_ll_usb_drd.c
  ret = USB_SetDevSpeed(USBx, cfg.speed);
  if (ret != HAL_OK)
  {
    LL_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
    return ret;
  }

  /* Issue a DEPSTARTCFG command with DEPCMD0.XferRscIdx set to 0,
  to initialize the transfer resource allocation */
  (void)memset(&params, 0x00, sizeof(params));
  ret = USB_ExecuteDevEPCmd(USBx, 0U, DWC3_DEPCMD_PARAM(0UL) | USB_DWC3_DEPCMD_DEPSTARTCFG, &params);
  if (ret != HAL_OK)
  {
    LL_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
    return ret;
  }

  /* Configure Control EP 0 & 1 mapped to physical EP 0 & 1*/
  ret = USB_ConfigureEP(USBx, 0, false, EP_TYPE_CTRL, cfg.ep0_mps, 0, 0, 0, ep0->intr_num, USB_DWC3_DEPCFG_ACTION_INIT);
  if (ret != HAL_OK)
  {
    LL_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
    return ret;
  }
  ret = USB_ConfigureEP(USBx, 0, true, EP_TYPE_CTRL, cfg.ep0_mps, 0, 0, 1, ep0->intr_num, USB_DWC3_DEPCFG_ACTION_INIT);
  if (ret != HAL_OK)
  {
    LL_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
    return ret;
  }

  /* Transfer Resource for Control EP 0 & 1*/
  (void)memset(&params, 0x00, sizeof(params));
  params.param0 = DWC3_DEPXFERCFG_NUM_XFER_RES(1U);
  /* As per databook, "Issue a DEPSTARTCFG command with DEPCMD0.XferRscIdx set to 2 to re-initialize the
  transfer resource allocation on SetConfiguration or SetInterface Request", value is 2 since the EP0 & EP1
  take up the transfer resource 1 & 2, hence further EPs will take resources 2,3,&up.. But in HAL we are not
  decoding the Setup-packet requests, this should ideally come from USB-MW core.
  Instead we follow the same method as Linux dwc3-gadget controller driver, All hardware endpoints can be
  assigned a transfer resource and this setting will stay persistent until either a core reset or hibernation.
  So whenever we do a DEPSTARTCFG(0) we can go ahead and do DEPXFERCFG for every hardware endpoint as well.
  For all k = DWC3_IP_NUM_EPS */
  for (i = 0; i < DWC3_IP_NUM_EPS; i++)
  {
    ret = USB_ExecuteDevEPCmd(USBx, i, USB_DWC3_DEPCMD_SETTRANSFRESOURCE, &params);
    if (ret != HAL_OK)
    {
      LL_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
      return ret;
    }
  }

  /* setup EP0 to receive SETUP packets */
  ret = USB_EP0_OutStart(USBx, ep0, setup_buf_dma_addr);
  if (ret != HAL_OK)
  {
    LL_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
    return ret;
  }

  /* Enable EP 0 & 1 */
  DWC3_RegUpdateSet(USBx, DWC3_DALEPENA, DWC3_DALEPENA_EP(0) | DWC3_DALEPENA_EP(1));

  /* Set interrupt/EventQ number on which non-endpoint-specific device-related interrupts are generated */
  reg = DWC3_RegRead(USBx, DWC3_DCFG) & ~USB3_DCFG_INTRNUM_Msk;
  DWC3_RegWrite(USBx, DWC3_DCFG, reg | ((uint32_t)intr_dev << USB3_DCFG_INTRNUM_Pos));

  /* Enable all events but Start and End of Frame IRQs */
  DWC3_RegUpdateSet(USBx, DWC3_DEVTEN, USB3_DEVTEN_VENDEVTSTRCVDEN | USB3_DEVTEN_EVNTOVERFLOWEN |
                    USB3_DEVTEN_CMDCMPLTEN | USB3_DEVTEN_ERRTICERREVTEN | USB3_DEVTEN_U3L2L1SuspEn |
                    USB3_DEVTEN_HibernationReqEvtEn | USB3_DEVTEN_WKUPEVTEN | USB3_DEVTEN_ULSTCNGEN |
                    USB3_DEVTEN_CONNECTDONEEVTEN | USB3_DEVTEN_USBRSTEVTEN | USB3_DEVTEN_DISSCONNEVTEN |
                    USB3_DEVTEN_L1SUSPEN | USB3_DEVTEN_L1WKUPEVTEN);

  if (cfg.Sof_enable)
  {
    DWC3_RegUpdateSet(USBx, DWC3_DEVTEN, USB3_DEVTEN_SOFTEVTEN);
  }

  /* Enable Event Buffer interrupt k = USB_DWC3_INT_INUSE */
  for (i = 0; i < USB_DWC3_INT_INUSE; i++)
  {
    USB_EnableEventInt(USBx, i);
  }

  return HAL_OK;
}

/**
  * @brief  USB_SetDevSpeed :Initializes the DevSpd field of DCFG register
  *         depending the PHY type and the enumeration speed of the device.
  * @param  USBx  Selected device
  * @param  speed  device speed
  *          This parameter can be one of these values:
  *            @arg USB_DWC3_SPEED_HIGH: High speed mode
  *            @arg USB_DWC3_SPEED_HIGH_IN_FULL: High speed core in Full Speed mode
  *            @arg USB_DWC3_SPEED_FULL: Full speed mode
  *            @arg USB_DWC3_SPEED_LOW: Low speed mode
  * @retval  Hal status
  */
HAL_StatusTypeDef USB_SetDevSpeed(USB3_TypeDef *USBx, uint8_t speed)
{
  uint32_t reg;
  HAL_StatusTypeDef ret = HAL_OK;
  reg = DWC3_RegRead(USBx, DWC3_DCFG) & ~USB3_DCFG_DEVSPD_Msk;

  switch (speed)
  {
    case USB_DWC3_SPEED_SUPER:
      DWC3_RegWrite(USBx, DWC3_DCFG, reg | DWC3_DSTS_SUPERSPEED);
      LL_DBGLOG2("%s = SuperSpeed\n", __func__);
      break;
    case USB_DWC3_SPEED_HIGH:
      DWC3_RegWrite(USBx, DWC3_DCFG, reg |  DWC3_DSTS_HIGHSPEED);
      LL_DBGLOG2("%s = HighSpeed\n", __func__);
      break;
    case USB_DWC3_SPEED_FULL_48:
      DWC3_RegWrite(USBx, DWC3_DCFG, reg |  DWC3_DSTS_FULLSPEED1);
      LL_DBGLOG2("%s = FullSpeed_48M\n", __func__);
      break;
    case USB_DWC3_SPEED_FULL:
      DWC3_RegWrite(USBx, DWC3_DCFG, reg |  DWC3_DSTS_FULLSPEED2);
      LL_DBGLOG2("%s = FullSpeed\n", __func__);
      break;
    case USB_DWC3_SPEED_LOW:
      DWC3_RegWrite(USBx, DWC3_DCFG, reg |  DWC3_DSTS_LOWSPEED);
      LL_DBGLOG2("%s = LowSpeed\n", __func__);
      break;
    default:
      ret = HAL_ERROR;
      break;
  }

  return ret;
}

/**
  * @brief  USB_GetDevSpeed :Return the  Dev Speed
  * @param  USBx  Selected device
  * @retval speed : device speed
  *          This parameter can be one of these values:
  *            @arg USB_DWC3_SPEED_HIGH: High speed mode
  *            @arg USB_DWC3_SPEED_FULL: Full speed mode
  *            @arg USB_DWC3_SPEED_LOW: Low speed mode
  */
uint8_t USB_GetDevSpeed(USB3_TypeDef *USBx)
{
  uint32_t reg;
  uint8_t ret;
  reg = DWC3_RegRead(USBx, DWC3_DSTS) & USB3_DSTS_CONNECTSPD;

  switch (reg)
  {
    case DWC3_DSTS_SUPERSPEED:
      ret = USB_DWC3_SPEED_SUPER;
      LL_DBGLOG2("%s = SuperSpeed\n", __func__);
      break;
    case DWC3_DSTS_HIGHSPEED:
      ret = USB_DWC3_SPEED_HIGH;
      LL_DBGLOG2("%s = HighSpeed\n", __func__);
      break;
    case DWC3_DSTS_FULLSPEED1:
      ret = USB_DWC3_SPEED_FULL_48;
      LL_DBGLOG2("%s = FullSpeed_48M\n", __func__);
      break;
    case DWC3_DSTS_FULLSPEED2:
      ret = USB_DWC3_SPEED_FULL;
      LL_DBGLOG2("%s = FullSpeed\n", __func__);
      break;
    case DWC3_DSTS_LOWSPEED:
      ret = USB_DWC3_SPEED_LOW;
      LL_DBGLOG2("%s = LowSpeed\n", __func__);
      break;
    default: /* Invalid */
      ret = USB_DWC3_SPEED_INVALID;
      LL_DBGLOG2("%s = Invalid\n", __func__);
      break;
  }

  return ret;
}

/**
  * @brief  Activate and configure an endpoint
  * @param  USBx  Selected device
  * @param  ep pointer to endpoint structure
  * @retval HAL status
  */
HAL_StatusTypeDef USB_ActivateEndpoint(USB3_TypeDef *USBx, USB_DWC3_EPTypeDef *ep)
{
  HAL_StatusTypeDef ret;
  ret = USB_ConfigureEP(USBx, ep->num, ep->is_in, ep->type, ep->maxpacket, ep->tx_fifo_num, ep->bInterval,
                        ep->phy_epnum, ep->intr_num, USB_DWC3_DEPCFG_ACTION_INIT);
  if (ret != HAL_OK)
  {
    return ret;
  }

  /* Enable EP */
  ret = USB_EnableEndpoint(USBx, ep->phy_epnum);
  if (ret != HAL_OK)
  {
    /* Return Error */
    return ret;
  }

  return HAL_OK;
}

/**
  * @brief  De-activate and de-initialize an endpoint
  * @param  USBx  Selected device
  * @param  ep pointer to endpoint structure
  * @retval HAL status
  */
HAL_StatusTypeDef USB_DeactivateEndpoint(USB3_TypeDef *USBx, USB_DWC3_EPTypeDef *ep)
{
  HAL_StatusTypeDef ret;
  LL_DBGLOG2("%s PHYEP%d %x\n", __func__, ep->phy_epnum, ep->flags);

