zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_ll_usb_drd.c
  if (ep->is_stall)
  {
    ret = USB_EPClearStall(USBx, ep);
    if (ret != HAL_OK)
    {
      /* Return Error */
      return ret;
    }
  }

  /* Disable EP */
  return USB_DisableEndpoint(USBx, ep->phy_epnum);
}

/**
  * @brief  USB_EPStartXfer : setup and starts a transfer over an EP
  * @param  USBx  Selected device
  * @param  ep pointer to endpoint structure
  * @param  dma USB dma enabled or disabled
  *          This parameter can be one of these values:
  *           0 : DMA feature not used
  *           1 : DMA feature used
  * @retval HAL status
  */
HAL_StatusTypeDef USB_EPStartXfer(USB3_TypeDef *USBx, USB_DWC3_EPTypeDef *ep)
{
  HAL_StatusTypeDef ret;
  USB_DWC3_EPCmd cmd;
  USB_DWC3_EPCmdParams params;
  uint8_t phy_epnum = ep->phy_epnum;

  LL_DBGLOG1("%s PHYEP%d %x\n", __func__, ep->phy_epnum, ep->flags);

  /* Wait for XferNotReady to get the uF interval to srat ISOC transfers */
  if ((ep->type == EP_TYPE_ISOC) && ((ep->flags & USB_DWC3_EP_ISOC_START_PENDING) == 0U)
      && ((ep->flags & USB_DWC3_EP_ISOC_STARTED) == 0U))
  {
    ep->flags |= USB_DWC3_EP_ISOC_START_PENDING;
    LL_DBGLOG1("INSIDE IF\n");
    return HAL_OK;
  }

  if ((ep->type == EP_TYPE_ISOC) && ((ep->flags & USB_DWC3_EP_ISOC_START_PENDING) != 0U))
  {
    ep->flags &= ~USB_DWC3_EP_ISOC_START_PENDING;
  }

  ep->trb_addr->bpl = LOWER_32_BITS(ep->dma_addr);
  ep->trb_addr->bph = UPPER_32_BITS(ep->dma_addr);
  ep->trb_addr->size = DWC3_TRB_SIZE_LENGTH(ep->xfer_len);
  ep->trb_addr->ctrl = DWC3_GetTRBCtlType(ep->trb_flag & USB_DWC3_TRBCTL_MASK); /* also initializes other bits to 0 */

  ep->trb_addr->ctrl |= ((ep->num == 0U) ? DWC3_TRB_CTRL_ISP_IMI : 0U);
  ep->trb_addr->ctrl |= DWC3_TRB_CTRL_IOC;

  if ((ep->type == EP_TYPE_ISOC) && ((ep->flags & USB_DWC3_EP_ISOC_STARTED) != 0U))
  {
    cmd = USB_DWC3_DEPCMD_UPDATETRANSFER;
  }
  else
  {
    cmd = USB_DWC3_DEPCMD_STARTTRANSFER;
  }

  if (ep->type == EP_TYPE_ISOC)
  {
    ep->trb_addr->ctrl |= DWC3_TRB_CTRL_ISP_IMI | DWC3_TRB_CTRL_CSP;

    if (cmd == USB_DWC3_DEPCMD_STARTTRANSFER)
    {
      cmd |= DWC3_DEPCMD_PARAM(ep->uframe + ((1UL << (ep->bInterval - 1U)) * 4U));

      ep->trb_addr[1].bpl = LOWER_32_BITS(ep->trb_dma_addr);
      ep->trb_addr[1].bph = UPPER_32_BITS(ep->trb_dma_addr);
      ep->trb_addr[1].ctrl |= DWC3_TRBCTL_LINK_TRB | DWC3_TRB_CTRL_HWO;
    }
    else
    {
      cmd |= DWC3_DEPCMD_PARAM((uint32_t)ep->resc_idx);
    }
  }
  else
  {
    ep->trb_addr->ctrl |= DWC3_TRB_CTRL_LST;
  }

  ep->trb_addr->ctrl |= DWC3_TRB_CTRL_HWO;

  (void)memset(&params, 0x00, sizeof(params));

  if ((cmd & USB3_DEPCMD_CMDTYP_Msk) == USB_DWC3_DEPCMD_STARTTRANSFER)
  {
    params.param0 = UPPER_32_BITS(ep->trb_dma_addr);
    params.param1 = LOWER_32_BITS(ep->trb_dma_addr);
  }

  ep->flags |= USB_DWC3_EP_REQ_QUEUED;
  if ((ep->type == EP_TYPE_ISOC) && ((cmd & USB3_DEPCMD_CMDTYP_Msk) == USB_DWC3_DEPCMD_STARTTRANSFER))
  {
    ep->flags |= USB_DWC3_EP_ISOC_STARTED;
  }

  LL_DBGLOG1("EP%d%s: trb %08lx:%08lx:%08lx:%08lx:%08lx length %ld %d\n", ep->num, ep->is_in ? "IN" : "OUT",
             (uint32_t)ep->trb_addr, (uint32_t)ep->trb_addr->bph,
             (uint32_t)ep->trb_addr->bpl, (uint32_t)ep->trb_addr->size,
             (uint32_t)ep->trb_addr->ctrl, ep->xfer_len, ep->flags);

  ret = USB_ExecuteDevEPCmd(USBx, ep->phy_epnum, cmd, &params);
  if (ret != HAL_OK)
  {
    ep->flags &= ~USB_DWC3_EP_REQ_QUEUED;
    if ((ep->type == EP_TYPE_ISOC) && ((cmd & USB3_DEPCMD_CMDTYP_Msk) == USB_DWC3_DEPCMD_STARTTRANSFER))
    {
      ep->flags &= ~USB_DWC3_EP_ISOC_STARTED;
    }
    return ret;
  }

  if ((cmd & USB3_DEPCMD_CMDTYP_Msk) == USB_DWC3_DEPCMD_STARTTRANSFER)
  {
    ep->resc_idx = (uint8_t)DWC3_DEPCMD_GET_RSC_IDX(DWC3_RegRead(USBx, DWC3_DEPCMD(phy_epnum)));
  }

  return ret;
}

/**
  * @brief  USB_EPSetStall : set a stall condition over an EP
  * @param  USBx  Selected device
  * @param  ep pointer to endpoint structure
  * @retval HAL status
  */
HAL_StatusTypeDef USB_EPSetStall(USB3_TypeDef *USBx, USB_DWC3_EPTypeDef *ep)
{
  USB_DWC3_EPCmdParams params;
  (void)memset(&params, 0x00, sizeof(params));
  return USB_ExecuteDevEPCmd(USBx, ep->phy_epnum, USB_DWC3_DEPCMD_SETSTALL, &params);
}


/**
  * @brief  USB_EPClearStall : Clear a stall condition over an EP
  * @param  USBx  Selected device
  * @param  ep pointer to endpoint structure
  * @retval HAL status
  */
HAL_StatusTypeDef USB_EPClearStall(USB3_TypeDef *USBx, USB_DWC3_EPTypeDef *ep)
{
  USB_DWC3_EPCmdParams params;
  (void)memset(&params, 0x00, sizeof(params));
  return USB_ExecuteDevEPCmd(USBx, ep->phy_epnum, USB_DWC3_DEPCMD_CLEARSTALL, &params);
}

/**
  * @brief  USB_SetDevAddress : Stop the usb device mode
  * @param  USBx  Selected device
  * @param  address  new device address to be assigned
  *          This parameter can be a value from 0 to 255
  * @retval HAL status
  */
HAL_StatusTypeDef USB_SetDevAddress(USB3_TypeDef *USBx, uint8_t address)
{
  LL_DBGLOG1("%s: %d\n", __func__, address);
  /* set device address */
  DWC3_RegUpdateClr(USBx, DWC3_DCFG, USB3_DCFG_DEVADDR_Msk);
  DWC3_RegUpdateSet(USBx, DWC3_DCFG, DWC3_DCFG_DEVADDR((uint32_t)address));

  return HAL_OK;
}

/**
  * @brief  USB_SetTestMode : Set Test Mode for usb device mode
  * @param  USBx  Selected device
  * @param  test_mode  test mode to be set
  *          This parameter can be a value from 0 to 255
  * @retval HAL status
  */
HAL_StatusTypeDef USB_SetTestMode(USB3_TypeDef *USBx, uint8_t test_mode)
{
  LL_DBGLOG1("%s: %d\n", __func__, test_mode);
  /* set device address */
  DWC3_RegUpdateClr(USBx, DWC3_DCTL, USB3_DCTL_TSTCTL_Msk);
  DWC3_RegUpdateSet(USBx, DWC3_DCTL, (uint32_t)test_mode << USB3_DCTL_TSTCTL_Pos);

  return HAL_OK;
}

/**
  * @brief  USB_DevConnect : Connect the USB device by enabling the pull-up/pull-down
  * @param  USBx  Selected device
  * @retval HAL status
  */
HAL_StatusTypeDef  USB_DevConnect(USB3_TypeDef *USBx)
{
  DWC3_RegUpdateSet(USBx, DWC3_DCTL, USB3_DCTL_RUN_STOP);

  return HAL_OK;
}

/**
  * @brief  USB_DevDisconnect : Disconnect the USB device by disabling the pull-up/pull-down
  * @param  USBx  Selected device
  * @retval HAL status
  */
HAL_StatusTypeDef  USB_DevDisconnect(USB3_TypeDef *USBx)
{
  uint32_t timeout = 500; /* usec */
  DWC3_RegUpdateClr(USBx, DWC3_DCTL, USB3_DCTL_RUN_STOP);
  do
  {
    if ((DWC3_RegRead(USBx, DWC3_DSTS) & USB3_DSTS_DEVCTRLHLT) != 0U) /*"Halt Complete"*/
    {
      break;
    }

    /* Can be called from interrupt context hence cannot wait for Tick */
    USB_Delay(1); /*Need 1us delay*/
    timeout--;
    if (timeout == 0U)
      /* "Reset Timed Out" */
    {
      return HAL_TIMEOUT;
    }
  } while (true);

  return HAL_OK;
}

/**
  * @brief  Returns USB core mode
  * @param  USBx  Selected device
  * @retval return core mode : Host or Device
  *          This parameter can be one of these values:
  *           0 : Host
  *           1 : Device
  */
USB_DWC3_ModeTypeDef USB_GetMode(USB3_TypeDef *USBx)
{
  uint32_t reg;
  USB_DWC3_ModeTypeDef ret;
  reg = (DWC3_RegRead(USBx, DWC3_GCTL) & USB3_GCTL_PRTCAPDIR_Msk) >> USB3_GCTL_PRTCAPDIR_Pos;

  switch (reg)
  {
    case DWC3_GCTL_PRTCAP_DEVICE:
      ret = USB_DWC3_DEVICE_MODE;
      break;
    case DWC3_GCTL_PRTCAP_HOST:
      ret = USB_DWC3_HOST_MODE;
      break;
    case DWC3_GCTL_PRTCAP_OTG:
      ret = USB_DWC3_DRD_MODE;
      break;
    default:  /* Invalid */
      ret = USB_DWC3_INVALID_MODE;
      LL_DBGLOG1("Error : %s: %d\n", __func__, __LINE__);
      break;
  }

  return ret;
}

/**
  * @brief  Prepare the EP0 to start the first control setup
  * @param  USBx  Selected device
  * @param  dma USB dma enabled or disabled
  *          This parameter can be one of these values:
  *           0 : DMA feature not used
  *           1 : DMA feature used
  * @param  psetup  pointer to setup packet
  * @retval HAL status
  */
HAL_StatusTypeDef USB_EP0_OutStart(USB3_TypeDef *USBx, USB_DWC3_EPTypeDef *ep0, USB_DWC3_DmaBusAddr setup_buf_dma_addr)
{
  ep0->dma_addr = setup_buf_dma_addr;
  ep0->xfer_len = 8;
  ep0->trb_flag = USB_DWC3_TRBCTL_CONTROL_SETUP;
  return USB_EPStartXfer(USBx, ep0);
}

HAL_StatusTypeDef USB_ExecuteDevEPCmd(USB3_TypeDef *USBx, uint8_t phy_epnum, USB_DWC3_EPCmd cmd,
                                      USB_DWC3_EPCmdParams *params)
{
  uint32_t reg;
  uint32_t timeout = 500; /* usec */
  LL_DBGLOG1("PHYEP%d: cmd '%s' %08lx params %08lx %08lx %08lx\n", phy_epnum, DWC3_GetEPCmdString(cmd),
             (uint32_t)cmd, (uint32_t)params->param0, (uint32_t)params->param1, (uint32_t)params->param2);

