zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_ll_usb_drd.c
  DWC3_RegWrite(USBx, DWC3_DEPCMDPAR0(phy_epnum), params->param0);
  DWC3_RegWrite(USBx, DWC3_DEPCMDPAR1(phy_epnum), params->param1);
  DWC3_RegWrite(USBx, DWC3_DEPCMDPAR2(phy_epnum), params->param2);
  DWC3_RegWrite(USBx, DWC3_DEPCMD(phy_epnum), cmd | USB3_DEPCMD_CMDACT);
  do
  {
    reg = DWC3_RegRead(USBx, DWC3_DEPCMD(phy_epnum));
    if ((reg & USB3_DEPCMD_CMDACT) == 0U)   /*"Command Complete"*/
    {
      LL_DBGLOG1("Command Complete --> %ld PHYEP%d %lx\n", DWC3_DEPCMD_STATUS(reg), phy_epnum, reg);
      if (DWC3_DEPCMD_STATUS(reg) != 0U)
      {
        /* Return Error */
        return HAL_ERROR;
      }
      return HAL_OK;
    }

    USB_Delay(1); /*Need 1us delay*/
    timeout--;
    if (timeout == 0U)
    {
      LL_DBGLOG1("TIMEOUT Command Complete --> %ld PHYEP%d %lx\n", DWC3_DEPCMD_STATUS(reg), phy_epnum, reg);
      /* "Command Timed Out" */
      return HAL_TIMEOUT;
    }
  } while (true);
}

HAL_StatusTypeDef USB_ConfigureEP(USB3_TypeDef *USBx, USB_DWC3_EPNum epnum, bool is_in,
                                  uint8_t type, uint32_t max_packet, uint8_t tx_fifo, uint16_t bInterval,
                                  uint8_t phy_epnum, uint8_t intr_num, uint8_t action)
{
  USB_DWC3_EPCmdParams params;

  (void)memset(&params, 0x00, sizeof(params));
  params.param0 = DWC3_DEPCFG_EP_TYPE(type) | DWC3_DEPCFG_MAX_PACKET_SIZE(max_packet);
  /* Burst size is only needed in SuperSpeed mode */
  params.param0 |= DWC3_GetEPCFGAction(action);
  params.param1 = DWC3_DEPCFG_XFER_COMPLETE_EN | DWC3_DEPCFG_XFER_NOT_READY_EN;
  if (type == EP_TYPE_ISOC)
  {
    params.param1 |= DWC3_DEPCFG_XFER_IN_PROGRESS_EN;
  }

  params.param1 |= DWC3_DEPCFG_EP_NUMBER(((uint32_t)epnum << 1) + (is_in ? 1UL : 0UL));

  params.param1 |= DWC3_DEPCFG_EP_INTR_NUM(intr_num);

  if (is_in)
  {
    params.param0 |= DWC3_DEPCFG_FIFO_NUMBER(tx_fifo);
  }

  if (bInterval != 0U)
  {
    params.param1 |= DWC3_DEPCFG_BINTERVAL_M1(bInterval - 1UL);
  }

  return USB_ExecuteDevEPCmd(USBx, phy_epnum, USB_DWC3_DEPCMD_SETEPCONFIG, &params);
}

void USB_EnableEventInt(USB3_TypeDef *USBx, USB_DWC3_INTNum intr_num)
{
  DWC3_RegUpdateClr(USBx, DWC3_GEVNTSIZ(intr_num), USB3_GEVNTSIZ_EVNTINTRPTMASK_Msk);
}

void USB_DisableEventInt(USB3_TypeDef *USBx, USB_DWC3_INTNum intr_num)
{
  DWC3_RegUpdateSet(USBx, DWC3_GEVNTSIZ(intr_num), USB3_GEVNTSIZ_EVNTINTRPTMASK_Msk);
}

HAL_StatusTypeDef USB_EPStopXfer(USB3_TypeDef *USBx, USB_DWC3_EPTypeDef *ep)
{
  HAL_StatusTypeDef ret;
  USB_DWC3_EPCmd cmd;
  USB_DWC3_EPCmdParams params;
  LL_DBGLOG2("%s PHYEP%d %x\n", __func__, ep->phy_epnum, ep->flags);

  /*Reset ISOC flags*/
  if (ep->type == EP_TYPE_ISOC)
  {
    ep->flags &= ~(USB_DWC3_EP_ISOC_START_PENDING | USB_DWC3_EP_ISOC_STARTED);
  }

  if ((ep->flags & USB_DWC3_EP_REQ_QUEUED) == 0U)
  {
    /* Return Error */
    return HAL_ERROR;
  }

  (void)memset(&params, 0x00, sizeof(params));
  cmd = USB_DWC3_DEPCMD_ENDTRANSFER | USB3_DEPCMD_HIPRI_FORCERM | USB3_DEPCMD_CMDIOC
        | DWC3_DEPCMD_PARAM((uint32_t)ep->resc_idx);

  ret = USB_ExecuteDevEPCmd(USBx, ep->phy_epnum, cmd, &params);
  USB_Delay(100); /*Need Delay 100us as mentioned in Linux Driver*/

  ep->xfer_count = ep->xfer_len - (ep->trb_addr->size & DWC3_TRB_SIZE_MASK);
  ep->flags &= ~USB_DWC3_EP_REQ_QUEUED;

  return ret;
}

void USB_AckEventCount(USB3_TypeDef *USBx, USB_DWC3_INTNum intr_num, uint32_t evt_count)
{
  DWC3_RegWrite(USBx, DWC3_GEVNTCOUNT(intr_num), evt_count);
}

uint32_t USB_ReadInterruptCount(USB3_TypeDef *USBx, USB_DWC3_INTNum intr_num)
{
  return DWC3_RegRead(USBx, DWC3_GEVNTCOUNT(intr_num)) & DWC3_GEVNTCOUNT_MASK;
}

HAL_StatusTypeDef USB_ExecuteDevCmd(USB3_TypeDef *USBx, USB_DWC3_Cmd cmd, USB_DWC3_CmdParams *params)
{
  uint32_t reg;
  uint32_t timeout = 500; /* usec */

  DWC3_RegWrite(USBx, DWC3_DGCMDPAR, *params);
  DWC3_RegWrite(USBx, DWC3_DGCMD, cmd | USB3_DGCMD_CMDACT);
  do
  {
    reg = DWC3_RegRead(USBx, DWC3_DGCMD);
    if ((reg & USB3_DGCMD_CMDACT) == 0U)   /*"Command Complete"*/
    {
      if (DWC3_DGCMD_STATUS(reg) != 0U)
      {
        /* Return Error */
        return HAL_ERROR;
      }
      return HAL_OK;
    }

    /* Can be called from interrupt context hence cannot wait for Tick */
    USB_Delay(1); /* Need 1us delay*/
    timeout--;
    if (timeout == 0U)
    {
      LL_DBGLOG1("TIMEOUT Command Complete --> %ld %lx\n", DWC3_DGCMD_STATUS(reg), reg);
      /* "Command Timed Out" */
      return HAL_TIMEOUT;
    }
  } while (true);
}

HAL_StatusTypeDef USB_EnableEndpoint(USB3_TypeDef *USBx, uint8_t phy_epnum)
{
  if ((DWC3_RegRead(USBx, DWC3_DALEPENA) & DWC3_DALEPENA_EP(phy_epnum)) != 0U)
  {
    /* Return Error */
    return HAL_ERROR;
  }
  /* Enable EP */
  DWC3_RegUpdateSet(USBx, DWC3_DALEPENA, DWC3_DALEPENA_EP(phy_epnum));
  return HAL_OK;
}

HAL_StatusTypeDef USB_DisableEndpoint(USB3_TypeDef *USBx, uint8_t phy_epnum)
{
  /* Disable EP */
  DWC3_RegUpdateClr(USBx, DWC3_DALEPENA, DWC3_DALEPENA_EP(phy_epnum));
  return HAL_OK;
}

bool USB_IsEndpointEnabled(USB3_TypeDef *USBx, uint8_t phy_epnum)
{
  if ((DWC3_RegRead(USBx, DWC3_DALEPENA) & DWC3_DALEPENA_EP(phy_epnum)) != 0U)
  {
    return true;
  }

  return false;
}


HAL_StatusTypeDef USB_ActivateRemoteWakeup(USB3_TypeDef *USBx)
{
#ifdef USB3_SW_REMWAKEUP_USED
  HAL_StatusTypeDef ret;
  uint8_t link_state;
  uint32_t reg;
  uint32_t timeout = 100000; /* usec */

  link_state = (uint8_t)DWC3_DSTS_USBLNKST(DWC3_RegRead(USBx, DWC3_DSTS));
  if ((link_state != DWC3_LINK_STATE_EARLY_SUS) &&
      (link_state != DWC3_LINK_STATE_L1) &&
      (link_state != DWC3_LINK_STATE_L2))
  {
    LL_DBGLOG2("Can't wakeup from link state %d\n", link_state);
    return HAL_ERROR;
  }

  ret = DWC3_SetLinkState(USBx, DWC3_DCTL_ULSTCHNG_RECOVERY);
  if (ret != HAL_OK)
  {
    LL_DBGLOG("Failed to put link in Recovery\n");
    return HAL_ERROR;
  }

  do
  {
    reg = DWC3_RegRead(USBx, DWC3_DSTS);
    if (DWC3_DSTS_USBLNKST(reg) == DWC3_LINK_STATE_ON)
    {
      LL_DBGLOG2("Wake-up Done\n");
      return HAL_OK;
    }

    /* Can be called from interrupt context hence cannot wait for Tick */
    USB_Delay(5);
    timeout -= 5;
    if (timeout == 0U)
    {
      LL_DBGLOG("Failed to send remote wakeup\n");
      /* "Command Timed Out" */
      return HAL_TIMEOUT;
    }
  } while (true);
#else
  DWC3_RegUpdateSet(USBx, DWC3_GUCTL1, USB3_GUCTL1_DEV_L1_EXIT_BY_HW);

  return HAL_OK;
#endif /*USB3_SW_REMWAKEUP_USED*/
}

