zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_ll_usb_drd.c
bool USB_IsEndpointEvent(uint32_t event)
{
  return ((event & DWC3_EVT_TYPE_MASK) == (DWC3_EVT_TYPE_EP << DWC3_EVT_TYPE_BITPOS));
}

bool USB_IsDeviceEvent(uint32_t event)
{
  return ((event & DWC3_EVT_TYPE_MASK) == (DWC3_EVT_TYPE_DEVSPEC << DWC3_EVT_TYPE_BITPOS));
}

uint8_t USB_ReadEndpointEventType(uint32_t event)
{
  uint8_t ret;

  switch ((event & DWC3_EVT_DEPEVT_TYPE_MASK) >> DWC3_EVT_DEPEVT_TYPE_BITPOS)
  {
    case DWC3_DEPEVT_XFERCOMPLETE:
      ret =  USB_DWC3_DEPEVT_XFERCOMPLETE;
      break;
    case DWC3_DEPEVT_XFERINPROGRESS:
      ret =  USB_DWC3_DEPEVT_XFERINPROGRESS;
      break;
    case DWC3_DEPEVT_XFERNOTREADY:
      ret =  USB_DWC3_DEPEVT_XFERNOTREADY;
      break;
    case DWC3_DEPEVT_RXTXFIFOEVT:
      ret =  USB_DWC3_DEPEVT_RXTXFIFOEVT;
      break;
    case DWC3_DEPEVT_STREAMEVT:
      ret =  USB_DWC3_DEPEVT_STREAMEVT;
      break;
    case DWC3_DEPEVT_EPCMDCMPLT:
      ret =  USB_DWC3_DEPEVT_EPCMDCMPLT;
      break;
    default:
      ret = 0;
      break;
  }

  return ret;
}

uint8_t USB_ReadEndpointEventEpNum(uint32_t event)
{
  return (uint8_t)((event & DWC3_EVT_DEPEVT_EPNUM_MASK) >> DWC3_EVT_DEPEVT_EPNUM_BITPOS);
}
\
uint16_t USB_ReadEndpointEventParam(uint32_t event)
{
  return (uint16_t)((event & DWC3_EVT_DEPEVT_PARAM_MASK) >> DWC3_EVT_DEPEVT_PARAM_BITPOS);
}

uint8_t USB_ReadDeviceEventLinkState(uint32_t event)
{
  return (uint8_t)((event & DWC3_EVT_DEVEVT_LNKSTS_MASK) >> DWC3_EVT_DEVEVT_LNKSTS_BITPOS);
}

const char *USB_GetLinkStateString(uint8_t state)
{
  const char *ret;

  switch (state)
  {
    case DWC3_LINK_STATE_ON:
      ret = "ON";
      break;
    case DWC3_LINK_STATE_L1:
      ret = "L1";
      break;
    case DWC3_LINK_STATE_L2:
      ret = "L2";
      break;
    case DWC3_LINK_STATE_DIS:
      ret = "Disconnect";
      break;
    case DWC3_LINK_STATE_EARLY_SUS:
      ret = "Early Suspend";
      break;
    case DWC3_LINK_STATE_RESET:
      ret = "Reset";
      break;
    case DWC3_LINK_STATE_RESUME:
      ret = "Resume";
      break;
    default:
      ret = "UNKNOWN state";
      break;
  }

  return ret;
}

uint32_t USB_GetTRBLengthEP(const USB_DWC3_EPTypeDef *ep)
{
  return DWC3_TRB_SIZE_LENGTH(ep->trb_addr->size);
}

uint32_t USB_GetTRBStatusEP(const USB_DWC3_EPTypeDef *ep)
{
  return DWC3_TRB_SIZE_TRBSTS(ep->trb_addr->size);
}

uint8_t USB_ReadEndpointEventStatus(uint32_t event)
{
  uint8_t ret;

  switch ((event & DWC3_EVT_DEPEVT_STATUS_MASK) >> DWC3_EVT_DEPEVT_STATUS_BITPOS)
  {
    case DWC3_EVT_DEPEVT_STATUS_CONTROL_DATA:
      ret = USB_DWC3_DEPEVT_XFERNOTREADY_STATUS_CTRL_DATA;
      break;
    case DWC3_EVT_DEPEVT_STATUS_CONTROL_STATUS:
      ret = USB_DWC3_DEPEVT_XFERNOTREADY_STATUS_CTRL_STATUS;
      break;
    default:
      ret = 0;
      break;
  }

  return ret;
}

uint8_t USB_ReadDeviceEventType(uint32_t event)
{
  uint8_t ret;

  switch ((event & DWC3_EVT_DEVEVT_TYPE_MASK) >> DWC3_EVT_DEVEVT_TYPE_BITPOS)
  {
    case DWC3_DEVICE_EVENT_DISCONNECT:
      ret = USB_DWC3_DEVICE_EVENT_DISCONNECT;
      break;
    case DWC3_DEVICE_EVENT_RESET:
      ret = USB_DWC3_DEVICE_EVENT_RESET;
      break;
    case DWC3_DEVICE_EVENT_CONNECT_DONE:
      ret = USB_DWC3_DEVICE_EVENT_CONNECT_DONE;
      break;
    case DWC3_DEVICE_EVENT_LINK_STATUS_CHANGE:
      ret = USB_DWC3_DEVICE_EVENT_LINK_STATUS_CHANGE;
      break;
    case DWC3_DEVICE_EVENT_WAKEUP:
      ret = USB_DWC3_DEVICE_EVENT_WAKEUP;
      break;
    case DWC3_DEVICE_EVENT_HIBER_REQ:
      ret = USB_DWC3_DEVICE_EVENT_HIBER_REQ;
      break;
    case DWC3_DEVICE_EVENT_EOPF:
      ret = USB_DWC3_DEVICE_EVENT_EOPF;
      break;
    case DWC3_DEVICE_EVENT_SOF:
      ret = USB_DWC3_DEVICE_EVENT_SOF;
      break;
    case DWC3_DEVICE_EVENT_ERRATIC_ERROR:
      ret = USB_DWC3_DEVICE_EVENT_ERRATIC_ERROR;
      break;
    case DWC3_DEVICE_EVENT_CMD_CMPL:
      ret = USB_DWC3_DEVICE_EVENT_CMD_CMPL;
      break;
    case DWC3_DEVICE_EVENT_OVERFLOW:
      ret = USB_DWC3_DEVICE_EVENT_OVERFLOW;
      break;
    case USB_DWC3_DEVICE_EVENT_L1WAKEUP:
      ret = USB_DWC3_DEVICE_EVENT_OVERFLOW;
      break;
    default:
      ret = 0;
      break;
  }

  return ret;
}


#endif /* defined (HAL_PCD_MODULE_ENABLED) || defined (HAL_HCD_MODULE_ENABLED) */

/**
  * @}
  */
